import React, { useState } from "react";
import "./ParallaxScroll.css";
import Excercise from "./Excercise";

// קומפוננטת משנה
// const Excercise = () => {
//   return <div>הקומפוננטה הופיעה!</div>;
// };
import arrowGif from "../assets/arrow.gif";

const ParallaxScroll = (props) => {
  const titles = [
    "מעגל הוצאת אימון",
    "דקירת האימון בגרף",
    "חיבור האימון",
    "תיאום שטחים",
    "זימון מילואים",
    "כתיבת אישור תוכניות",
    "דרישת אמצעים",
    "הכנת סגל",
    "שאלות לווידוא ההבנה",
  ];
  const [activeTitle, setActiveTitle] = useState(titles[0]);

  const handleScroll = (event) => {
    const scrollPosition = event.target.scrollTop;
    const sectionHeight = window.innerHeight;

    const currentSection = Math.round(scrollPosition / sectionHeight);
    setActiveTitle(titles[currentSection]);
  };

  return (
    <div className="parallax-container" onScroll={handleScroll}>
      <h1 className="parallax-title">{activeTitle}</h1>
      <div className="parallax-section">
        <p>
          מש"ק יקר לאחר סיום הכשרתך המקצועית תיהיה מוסמך להוצאת אימונים למסלולי
          ההכשרה וליחידות השונות. לפני כל אימון שתוציא למסלול ההכשרה וליחידה
          תצטרך לעבור תהליך של תכנון ואישור טרם ביצועו
        </p>
        <img src={arrowGif} id="arrow" />
      </div>

      <div className="parallax-section">
        <p>
          {" "}
          גרף יחידה הוא גאנט המכיל את כל מופעי היחידה אשר נקבע מראש ומאושר על
          ידי האג"ם. במידה והאימון/סיו"ש אותו אתה רוצה להוביל לא נמצא על גרף
          יחידה יש להוסיף לגרף של הפלגה את האימון (מינימום 4-5 שבועות מראש לפני
          ביצועי האימון) ולוודא מול פ"פ ביס"ק שהוא אכן נכנס לגרף בית הספר/יחידה.
          במידה והאימון לא הועלה לגרף, הוא יימצא בתעדוף אחרון מבחינת הגורמים
          התומכים ביחידה
        </p>
      </div>

      <div className="parallax-section">
        <p>
          לפניי התחלת עבודה על הוצאת שבוע אימון יש לקרוא את סיכום השבוע של אותו
          אימון שבוצע בעבר ולעבור על לקחים. בנוסף יש לעבור על החומר המקצועי
          ולתקף אותו במידה שיש צורך
        </p>
      </div>

      <div className="parallax-section">
        <p>
          {" "}
          יש לבצע דרישת שטחים אל מול נציג ממחלקת התיאום. באחריות מוביל האימון
          להעביר את כלל פרטי האימון ואת השטחים הנדרשים אותם הוא מעוניין לתאם. על
          מנת לייעל את תהליך העבודה יש להגיש דרישה זו כמהנ שיותר זמן מראש
          (מינימום 4 שבועות לפני ביצועי האימון).בסיום תהליך התיאום ישלקבל טופס
          תיאום (מסמך המכיל את כלל ההנחיות שעלו במהלך תהליך התיאום ומהווה תעודת
          ביטוח לבעל האימון בזמן היותו בשטח) אין לרדת לשטח ללא טופס זה
        </p>
      </div>

      <div className="parallax-section">
        <p>
          לפני האימון יש להבין מהו יחס החניכה המינימלי(מופיע בהוראת האימון באתר)
          הנדרש להוצאת אימון אידיאלית. במידה ויש צורך בזימון מילואים, יש לשלוח
          דרישת מילואים ע"פ פורמט של מחלקת האג"מ (מינימום שבוע וחצי לפני ביצוע
          האימון) ולוודא מול מחלקת האג"מ ומול המילואימניקים המוזמנים שהם אכן
          קיבלו צו
        </p>
      </div>

      <div className="parallax-section">
        <p>
          לכל שבוע אימון שיוצא ביחידה נדרש לכתוב אישור תוכניות ולאשר אותו כשבוע
          מראש אצל מפל"ג ההדרכה/אימונים ביחידה. אין שבוע אימון שיוצא ללא אישור
          של התוכניות לששבוע,נוכחות של מוביל האימון ומפקד האימון היא הכרחית.יש
          צורך לכתוב אישור תוכניות ע"פ פורמט היחידה
        </p>
      </div>

      <div className="parallax-section">
        <p>
          על מנת לקבל את כל הציוד הנדרש לאימון יש למלא פורמט דרישות אמצעים של
          מחלקת המרש"ל בהתאם לתכנון מתווה האימון,המנהלת,כמות האנשים וכו. את
          הקובץ יש להגיש עד יום ג' שבועיים לפניי מועד האימון(לשלוח במייל למשקית
          מרש"ל) לאחר דרישת האמצעים יש להגיע למופע תיאום פעילות מקדים שמתקיים
          ביום א' שבוע לפני האימון-נועד לעבור על הדרישות מול המחלקות השונות
          ולהציף פערים כלשהם שעלולים להיות. תיאום פעילות סופי מתקיים ביום חמישי
          שבוע לפני האימון נוהוא נועד לסכם ולקבוע פרטים אחרונים שהתבצעו בדרישות
        </p>
      </div>

      <div className="parallax-section">
        <p>
          על מנת שכלל סגל ההדרכה יגיע לאימון עם רמת הידע הנדרשת וידעו מהם
          ההישגים הנדרשים מאותו שבוע אימון יש לבצע הכנת סגל של כלל הסגל המשתתף
          באימון - מדריכות/ מילואימניקים/ מפקד-אימון כאשר המשקית המבוילה היא
          אחראיצת על ביצוע הכנת הסגל ועל התכנים המקצועיים וההדרכתיים המועברים בו
        </p>
      </div>

      <div className="parallax-section">
        <button id="ex" onClick={() => props.setShowBook(true)}>
          יאללה לתרגול
        </button>
      </div>
    </div>
  );
};

export default ParallaxScroll;
